app/Controllers/Admin.php

SELECT *
FROM `menu`
---
    public function index()
    {
        // $lapangan = $this->lapanganModel->findAll();
        // dd($lapangan);
        $menu = $this->menuModel->findAll();