app/Models/LapanganModel.php

SELECT *
FROM `lapangan`
WHERE `username` = 'daffakuy'
---
    public function getData($username)
    {
        $builder = $this->table('lapangan');
        $builder->where('username', $username);
        $query = $builder->get();